[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/TMttj56/1.jpg",
    "review": "F. Scott Fitzgerald's The Great Gatsby is a mesmerizing tale of love, longing, and the pursuit of the American Dream. Set amidst the glitz and glamour of the Jazz Age, the novel follows the enigmatic Jay Gatsby as he seeks to win back the heart of his former flame, Daisy Buchanan. Through the eyes of narrator Nick Carraway, we are drawn into a world of extravagant parties, secret affairs, and tragic consequences. Fitzgerald's lyrical prose and vivid imagery capture the essence of an era defined by excess and disillusionment. With its timeless themes of wealth, class, and identity, The Great Gatsby remains a quintessential American classic.",
    "totalPages": "180",
    "rating": "4.5",
    "category": "Fiction",
    "tags": ["#Classic", "#Romance"],
    "publisher": "Scribner",
    "yearOfPublishing": "1925"
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/gzv4381/2.webp",
    "review": "To Kill a Mockingbird is a timeless classic that explores the complexities of race, justice, and morality in the American South. Through the eyes of young Scout Finch, we witness her father, Atticus, defending Tom Robinson, a black man falsely accused of raping a white woman. Set against the backdrop of the Great Depression, the novel confronts prejudice, inequality, and the loss of innocence. Harper Lee's masterful storytelling and vivid characters capture the essence of a bygone era while addressing issues that remain relevant today. With its poignant narrative and thought-provoking themes, To Kill a Mockingbird continues to resonate with readers of all ages.",
    "totalPages": "281",
    "rating": "4.8",
    "category": "Fiction",
    "tags": ["#Classic", "#Legal Drama"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": "1960"
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/QHcsTdw/3.jpg",
    "review": "In George Orwell's dystopian masterpiece, 1984, we are transported to a totalitarian society ruled by the oppressive Party and its enigmatic leader, Big Brother. Through the eyes of protagonist Winston Smith, we experience a world where individuality is suppressed, truth is manipulated, and dissent is punished. As Winston grapples with the Party's surveillance and thought control, he embarks on a dangerous journey of rebellion and self-discovery. Orwell's chilling portrayal of a society devoid of freedom and privacy serves as a stark warning against the dangers of authoritarianism and totalitarianism. With its timeless relevance and powerful message, 1984 remains a haunting reminder of the importance of preserving liberty and resisting tyranny.",
    "totalPages": "328",
    "rating": "4.7",
    "category": "Fiction",
    "tags": ["#Dystopian", "#Political Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": "1949"
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/r3Vtzwb/4.jpg",
    "review": "Pride and Prejudice, Jane Austen's timeless romance, is a delightful exploration of love, marriage, and societal expectations in early 19th-century England. Set in the bucolic countryside, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of courtship and class. Along the way, she encounters the enigmatic Mr. Darcy, whose aloof demeanor conceals a heart full of passion. As their relationship evolves from initial disdain to mutual admiration, Austen deftly examines the nuances of human nature and the intricacies of social hierarchy. With its witty dialogue, memorable characters, and timeless themes, Pride and Prejudice continues to captivate readers with its charm and sophistication.",  
    "totalPages": "432",
    "rating": "4.6",
    "category": "Fiction",
    "tags": ["#Classic", "#Romance"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": "1813"
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/jD6zYBf/5.webp",
    "review": "J.D. Salinger's The Catcher in the Rye is a compelling coming-of-age novel that explores the angst and alienation of adolescence. Narrated by the irreverent and introspective Holden Caulfield, the novel follows his journey through New York City after being expelled from boarding school. As Holden grapples with themes of identity, authenticity, and societal expectations, he encounters a cast of memorable characters and experiences moments of both profound connection and profound disillusionment. Salinger's sharp wit and keen insight into the human condition make The Catcher in the Rye a timeless classic that continues to resonate with readers of all generations.",
    "totalPages": "224",
    "rating": "4.4",
    "category": "Fiction",
    "tags": ["#Classic", "#Young Adult"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": "1951"
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/bFfp3hy/6.jpg",
    "review": "The Hobbit, written by J.R.R. Tolkien, is a timeless fantasy novel that follows the journey of Bilbo Baggins, a hobbit who is swept away from his comfortable life in the Shire to embark on an epic adventure. When Gandalf the wizard and a group of dwarves arrive at Bilbo's doorstep seeking his help in reclaiming their homeland from the dragon Smaug, Bilbo reluctantly agrees to join them. As they traverse through treacherous lands and encounter fantastical creatures, Bilbo discovers courage and inner strength he never knew he possessed. Tolkien's richly imagined world, populated with elves, dwarves, dragons, and other mythical beings, captivates readers of all ages. The Hobbit is a tale of heroism, friendship, and the power of the human spirit to overcome adversity.",
    "totalPages": "310",
    "rating": "4.9",
    "category": "Fantasy",
    "tags": ["#Classic", "#Adventure"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": "1937"
  },
  {
    "bookId": 7,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/S3RszKS/7.jpg",
    "review": "The Alchemist, written by Paulo Coelho, is a philosophical and spiritual novel that follows the journey of Santiago, a young shepherd boy from Andalusia, as he embarks on a quest to find his Personal Legend. Santiago's journey takes him across the vast deserts of Egypt, where he encounters a series of characters who impart wisdom and guidance. Along the way, Santiago learns valuable lessons about the importance of following one's dreams, listening to the heart's desires, and embracing the journey rather than focusing solely on the destination. Coelho's narrative is infused with themes of destiny, self-discovery, and the interconnectedness of all living beings. The Alchemist is a timeless tale that inspires readers to pursue their dreams with courage, determination, and unwavering faith.",
    "totalPages": "208",
    "rating": "4.7",
    "category": "Fiction",
    "tags": ["#Inspiration", "#Philosophy"],
    "publisher": "HarperCollins",
    "yearOfPublishing": "1988"
  },
  {
    "bookId": 8,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/pWTyCLf/8.jpg",
    "review": "Harry Potter and the Philosopher's Stone is the first novel in the iconic Harry Potter series written by J.K. Rowling. It follows the journey of a young boy named Harry Potter, who discovers on his eleventh birthday that he is a wizard and has been accepted to attend Hogwarts School of Witchcraft and Wizardry. As Harry begins his magical education, he uncovers the truth about his parents' mysterious deaths and learns of his connection to the dark wizard Voldemort. Alongside his loyal friends Ron Weasley and Hermione Granger, Harry navigates the challenges of school life while facing threats from dark forces that seek to destroy him. Rowling's imaginative storytelling, richly detailed world-building, and complex characters have captivated readers of all ages for decades. Harry Potter and the Philosopher's Stone is a timeless classic that continues to inspire and enchant readers around the world.",
    "totalPages": "332",
    "rating": "4.8",
    "category": "Fantasy",
    "tags": ["#Magic", "#Adventure"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": "1997"
  },
  {
    "bookId": 9,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/jfDG1Zp/9.jpg",
    "review": "The Da Vinci Code is a gripping thriller written by Dan Brown that takes readers on a thrilling journey through the world of art, religion, and conspiracy. The story follows Harvard symbologist Robert Langdon as he is drawn into a complex mystery surrounding the murder of a renowned curator at the Louvre Museum in Paris. With the help of French cryptologist Sophie Neveu, Langdon embarks on a quest to unravel the secrets hidden within famous works of art and uncover the truth behind a centuries-old secret society. As they race against time to solve the puzzle, Langdon and Neveu find themselves caught in a web of deceit, betrayal, and danger. Brown's masterful storytelling and meticulous research make The Da Vinci Code a captivating read that keeps readers on the edge of their seats until the very end.",
    "totalPages": "454",
    "rating": "4.3",
    "category": "Mystery",
    "tags": ["#Suspense", "#Thriller"],
    "publisher": "Doubleday",
    "yearOfPublishing": "2003"
  },
  {
    "bookId": 10,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/3f7Hzqf/10.jpg",
    "review": "The Hunger Games is a dystopian novel written by Suzanne Collins that takes place in a future where society is divided into districts, and children are forced to compete in a brutal televised event called the Hunger Games. The story follows sixteen-year-old Katniss Everdeen, who volunteers to take her sister's place in the Games. Alongside her fellow tribute, Peeta Mellark, Katniss must navigate the deadly arena while also contending with the political machinations of the Capitol. Collins' compelling narrative and vivid world-building make The Hunger Games a gripping and thought-provoking read that explores themes of survival, sacrifice, and rebellion.",
    "totalPages": "374",
    "rating": "4.6",
    "category": "Young Adult",
    "tags": ["#Dystopian", "#Adventure"],
    "publisher": "Scholastic",
    "yearOfPublishing": "2008"
  }
]
